app/Controllers/admin/akuncontroller.php

SELECT *
FROM `akun`
---
    public function index()
    {
        $data['akun'] = $this->akunModel->findAll();