app/Controllers/Admin/AkunController.php

SELECT *
FROM `akun`
---
    public function index()
    {
        $data['akun'] = $this->akunModel->findAll();