app/Controllers/admin/Pegawai.php

    public function index()
    {
        $data['Pegawai'] = $this->pegawaiModel->findAll(); // Ambil semua data pegawai
---
SELECT *
FROM `pegawai`