app/Controllers/pegawai/BiayaController.php

    public function index()
    {
        $data['Biaya'] = $this->BiayaModel->findAll();
---
SELECT *
FROM `Biaya`