app/Controllers/pegawai/PengajuanController.php

    public function index()
    {
        $data['Pengajuan'] = $this->PengajuanModel->findAll();
---
SELECT *
FROM `Pengajuan`