app/Controllers/Pegawai/PengajuanController.php

    public function index()
    {
        $data['Pengajuan'] = $this->PengajuanModel->findAll();
---
SELECT *
FROM `pengajuan`