app/Controllers/pegawai/PerjalananDinas.php

SELECT *
FROM `perjalanan_dinas`
---
    public function index()
{
    $data['perjalanan'] = $this->PerjalananDinasModel->asArray()->findAll(); // Ambil semua data perjalanan dinas