app/Controllers/Pegawai/PerjalananDinas.php

    public function index()
    {
        // Pastikan user sudah login
    $this->session = \Config\Services::session();
        if (!$this->session->get('loggedIn')) {
            // Redirect ke halaman login user
            return redirect()->to('/Login');  // Ganti /login dengan URL yang benar
        }

        $id_pegawai = $this->session->get('userId'); // Ambil ID pegawai dari session
        $data['perjalanan'] = $this->PerjalananDinasModel->where('Id_Pegawai', $id_pegawai)->findAll(); // Ambil pengajuan hanya untuk user ini
---
SELECT *
FROM `perjalanan_dinas`
WHERE `Id_Pegawai` = '16'