app/Controllers/LoginController.php

SELECT *
FROM `akun`
WHERE `Username` = 'miramira'
 LIMIT 1
---
    public function authenticate()
    {
        $username = $this->request->getPost('signin-username'); // Mengambil username dari input
        $password = $this->request->getPost('signin-password'); // Mengambil password dari input

        // Validasi input
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'signin-username' => 'required|min_length[3]|max_length[50]',
            'signin-password' => 'required|min_length[6]'
        ]);

        if (!$this->validate($validation->getRules())) {
            return redirect()->to('/Login')->withInput()->with('errors', $this->validator->getErrors());
        }

        $akunModel = new AkunModel();
        $akun = $akunModel->findByUsername($username);