app/Models/AkunModel.php

    public function findByUsername($username)
    {
        return $this->where('Username', $username)->first();
---
SELECT *
FROM `akun`
WHERE `Username` = 'rezaaaa'
 LIMIT 1