app/Models/PerjalananDinasModel.php

SELECT *
FROM `pengajuan`
---
    public function getPengajuan($idPengajuan = null)
    {
        // Jika idPengajuan diberikan, cari data pengajuan berdasarkan ID
        if ($idPengajuan === null) {
            return $this->db->table('pengajuan')->get()->getResult();